Revit 2027 API
BuiltInFailures.MEPCalculationFailures.SeparationNotAtJunction Property
 This hydraulic loop is not separated at any junction. Use the Remove Separation tool to clean up undesired hydraulic separations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SeparationNotAtJunction { get; }
Public Shared ReadOnly Property SeparationNotAtJunction As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SeparationNotAtJunction {
	FailureDefinitionId^ get ();
}
static member SeparationNotAtJunction : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace